export const messages = {
  "error": {
    "auth": {
      "invalidCredential": "حدث خطأ في عملية المصادقة. يرجى التأكد من صحة بيانات تسجيل الدخول وحاول مرة أخرى.",
      "emailInUse": "عنوان البريد الإلكتروني هذا {email} مرتبط بحساب موجود بالفعل. يرجى استخدام عنوان بريد إلكتروني آخر أو تسجيل الدخول إلى حسابك الحالي.",
      "phoneInUse": "رقم الهاتف هذا {phone} مرتبط بحساب موجود بالفعل. يرجى استخدام رقم هاتف آخر أو تسجيل الدخول إلى حسابك الحالي.",
      "emailOrPhoneInUse": "عنوان البريد الإلكتروني هذا {email} أو رقم الهاتف هذا {phone} مرتبط بحساب موجود بالفعل. يرجى استخدام عنوان بريد إلكتروني آخر أو رقم جوال آخر أو تسجيل الدخول إلى حسابك الحالي.",
      "requiresRecentLogin": "من أجل حماية حسابك، نطلب منك تسجيل الدخول مؤخرًا قبل السماح لك بإعادة تعيين كلمة المرور. هذا الإجراء يساعدنا على التأكد من أن الشخص الذي يحاول إعادة تعيين كلمة المرور هو مالك الحساب بالفعل."
    },
    "permission": {
      "pageAccess": "تسجيل الدخول ضروري لعرض هذه الصفحة.",
      "actionAccess": "لا يمكنك إجراء هذه العملية إلَّا بعد تسجيل الدخول"
    },
    "server": {
      "unavailable": "لا يمكن الوصول إلى الخادم حالياً. قد يكون هناك مشكلة في الاتصال بالشبكة."
    },
    "network": "حدث خطأ في الاتصال بالشبكة. يرجى التحقق من اتصالك بالإنترنت وحاول مرة أخرى."
  },
  "success": {
    "auth": {
      "login": {
        "title": "تمَّ عملية تسجيل الدخول بنجاح!",
        "description": "يرجى الانتظار قليلاً أثناء إعادة التوجيه"
      },
      "register": {
        "title": "تمَّ التسجيل بنجاح!",
        "description": "يرجى تسجيل الدخول للمتابعة"
      },
      "passwordUpdate": "تمَّ تعديل كلمة السر بنجاح",
      "logout": "تمَّ تسجيل الخروج بنجاح"
    },
    "data": {
      "operation": "تمَّت العملية بنجاح.",
      "create": "تمَّ إضافة البيانات بنجاح.",
      "update": "تمَّ تعديل البيانات بنجاح.",
      "delete": "تمَّ حذف البيانات بنجاح.",
      "comment": "تمَّ إضافة تعليقك بنجاح",
      "carAdded": "تم إرسال طلب السيارة بنجاح"
    }
  }
}